// Задача 2. Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("Input integer number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input min integer number: ");
int num2 = Convert.ToInt32(Console.ReadLine());

if(num1 > num2)
{
    Console.WriteLine($"{num1} is max and {num2} is min");
}
else
{
    Console.WriteLine($"{num2} is max and {num1} is min");
}
*/

